CF/Documents/nb_АнкетаУчастникаПрограммыЛояльностиДружба.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>nb_АнкетаУчастникаПрограммыЛояльностиДружба</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пол</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПолФизическогоЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Рекомендатель_БК</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Рекомендатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>nb_БК</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>nb_РайонПроживания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.nb_РайоныГорода</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>nb_СоглашениеНаУведомлениеSMS</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>nb_СоглашениеНаУведомлениеEMail</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EMail</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>nb_СоглашениеНаУведомлениеPUSH</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>nb_idВК</Name>
					<Comment>Идентификатов в соц. сети ВК</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>nb_ВГруппеВК</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>nb_ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Источник_2_ГИС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Источник_Администратор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Источник_Другое</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Источник_Друзья</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Источник_Сайт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Источник_СоцСети</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПервоеПосещение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДисконтнаяКарта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИнформационныеКарты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>nb_ЕстьРегистрацияВГруппеВК</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>nb_МесяцевПолученияБонусныхБаллов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаОбработкиАнкеты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗавершенияОбработкиАнкеты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

CF/InformationRegisters/ФИОФизЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ФИОФизЛиц</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CF/Documents/nb_АнкетаУчастникаПрограммыЛояльностиДружба/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ИнициализацияРеквизитов()
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.nb_ДатаРегистрации = ТекущаяДата();
		Объект.Ответственный = Пользователи.ТекущийПользователь();
	КонецЕсли;	
КонецПроцедуры	

Процедура ОчиститьРеквизиты(ИсключитьИзОчистки)
	МетаданныеОбъекта = Метаданные.Обработки.nb_ОбработкаАнкетУчастниковПрограммыЛояльностиДружба;
	
	Для Каждого Реквизит Из МетаданныеОбъекта.Реквизиты Цикл
		Если СтрНайти(ИсключитьИзОчистки, Реквизит.Имя) > 0 Тогда
			Продолжить;
		КонецЕсли;	
		Объект[Реквизит.Имя] = Неопределено;
	КонецЦикла;	
	Объект.Клиент = Неопределено;
КонецПроцедуры	


&НаСервере
Процедура ВыполнитьРегистрациюНаСервере(Отказ)
	ФизЛицоССылка = nb_ПрограммаЛояльностиДружбаСервер.ПолучитьФизЛицоПоБК(Объект.nb_БК);
	Если НЕ ФизЛицоССылка.Пустая() Тогда
		Попытка
			НачатьТранзакцию();
			ФизЛицоОбъект = ФизЛицоССылка.ПолучитьОбъект();
			
			ЗаполнитьЗначенияСвойств(ФизЛицоОбъект, Объект);
			ФизЛицоОбъект.Наименование = Объект.Фамилия + " " +Объект.Имя + " " + Объект.Отчество;
			УправлениеКонтактнойИнформацией.ДобавитьКонтактнуюИнформацию(ФизЛицоОбъект, Объект.EMail, Справочники.ВидыКонтактнойИнформации.EmailФизическогоЛица);
			УправлениеКонтактнойИнформацией.ДобавитьКонтактнуюИнформацию(ФизЛицоОбъект, Объект.Телефон, Справочники.ВидыКонтактнойИнформации.ТелефонФизическогоЛица);
			ФизЛицоОбъект.Записать();
			
			МенеджерЗаписи = РегистрыСведений.ФИОФизЛиц.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.ФизЛицо = ФизЛицоССылка;
			МенеджерЗаписи.Период = ФизЛицоОбъект.ДатаРождения;
			МенеджерЗаписи.Фамилия = Объект.Фамилия;
			МенеджерЗаписи.Имя = Объект.Имя;
			МенеджерЗаписи.Отчество = Объект.Отчество;
			МенеджерЗаписи.Записать(Истина);

			
			ДисконтнаяКартаСсылка = nb_ПрограммаЛояльностиДружбаСервер.ПолучитьДисконтнуюКартуПоБК(ФизЛицоССылка, Объект.nb_БК);
			Если НЕ ДисконтнаяКартаСсылка.Пустая() Тогда
				ДисконтнаяКартаОбъект = ДисконтнаяКартаСсылка.ПолучитьОбъект();
				ДисконтнаяКартаОбъект.Наименование = ДисконтнаяКартаОбъект.КодКарты + " " + ФизЛицоОбъект.Наименование; 
				ДисконтнаяКартаОбъект.Записать();
			КонецЕсли;	
			
			
			ЗафиксироватьТранзакцию();
			Объект.Клиент = ФизЛицоОбъект.ССылка;
		Исключение
			Отказ = Истина;
			ОтменитьТранзакцию();
		КонецПопытки;	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьРегистрацию(Команда)
	Отказ = Ложь;
	ВыполнитьРегистрациюНаСервере(Отказ);
	Если НЕ Отказ Тогда
		Сообщить("Анкета зарегистрирована: "+Объект.Клиент);
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ИнициализацияРеквизитов();
КонецПроцедуры

&НаСервере
Процедура nb_БКПриИзмененииНаСервере()
	ОчиститьРеквизиты("nb_БК, nb_ДатаРегистрации, Ответственный");
	Объект.Клиент = nb_ПрограммаЛояльностиДружбаСервер.ПолучитьФизЛицоПоБК(Объект.nb_БК);
	Если ЗначениеЗаполнено(Объект.Клиент.nb_ДатаРегистрации) Тогда
		ЗаполнитьЗначенияСвойств(Объект, Объект.Клиент);
		ФИО = nb_ПрограммаЛояльностиДружбаСервер.ПолучитьФИОФизЛица(Объект.Клиент);
		ЗаполнитьЗначенияСвойств(Объект, ФИО);
		
		Объект.EMail 	= УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Объект.Клиент, Справочники.ВидыКонтактнойИнформации.EmailФизическогоЛица);
		Объект.Телефон 	= УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Объект.Клиент, Справочники.ВидыКонтактнойИнформации.ТелефонФизическогоЛица);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура nb_БКПриИзменении(Элемент)
	nb_БКПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура КомандаНоваяАнкетаНаСервере()
	// Очистить все поля
	ОчиститьРеквизиты("nb_ДатаРегистрации, Ответственный");
КонецПроцедуры

&НаКлиенте
Процедура КомандаНоваяАнкета(Команда)
	КомандаНоваяАнкетаНаСервере();
КонецПроцедуры

&НаСервере
Процедура РекомендательПриИзмененииНаСервере()
	Объект.Рекомендатель_БК = Объект.Рекомендатель.nb_БК;	
КонецПроцедуры

&НаКлиенте
Процедура РекомендательПриИзменении(Элемент)
	РекомендательПриИзмененииНаСервере();
КонецПроцедуры
